app/controllers/races_controller.rb

  def index
    @races = Race.paginate(:page => params[:page], :per_page => 5)
---
SELECT "races".* FROM "races"

  def create
    @race = Race.new(race_params)

    respond_to do |format|
      if @race.save
---
INSERT INTO "races" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Człowiek"], ["description", "Najszerzej spotykana w świecie rasa."], ["created_at", 2016-02-26 09:27:36 UTC], ["updated_at", 2016-02-26 09:27:36 UTC]]

    def set_race
      @race = Race.find(params[:id])
---
SELECT  "races".* FROM "races" WHERE "races"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]